---
kind: property
id: P:Autodesk.Revit.UI.TaskDialog.AllowCancellation
zh: 提示、弹窗、消息框
source: html/72a2b8b0-1da8-2726-9da6-c03d76e13288.htm
---
# Autodesk.Revit.UI.TaskDialog.AllowCancellation Property

**中文**: 提示、弹窗、消息框

Whether the task dialog can be cancelled if no cancel button is specified.

## Syntax (C#)
```csharp
public bool AllowCancellation { get; set; }
```

## Remarks
The default value is true. If there is a cancel button in the task dialog, the it always can be cancelled.